Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainDoesNotEngageUorV Property
 A chain formed by these curve elements does engage any gridlines on the face to be divided and will be ignored
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCurveChainDoesNotEngageUorV { get; }
Public Shared ReadOnly Property DividedSurfaceCurveChainDoesNotEngageUorV As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainDoesNotEngageUorV {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCurveChainDoesNotEngageUorV : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace